Updating kiro documents based on AWS CDK best practice power added. Also adding CLAUDE.md
